Revit 2026 API

# LevelAssociationData Methods

---

The LevelAssociationData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAssociatedLevel | Returns the Associated Level id. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLevelAssociationData | Returns LevelAssociationData associated with this element, if it exists. |
|  | GetLevelOffset | Returns the offset from the Associated Level. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetAssociatedLevel | Sets the Associated Level. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

LevelAssociationData Class

Autodesk.Revit.DB Namespace